---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.HasValue
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.HasValue

The element has a value for the specified parameter. No value is specified.